Merge pull request #237 from utter-one/documentation-diagrams
Documentation diagrams
